Tekla.Structures.ModelInternal.BasePoint
The base point data.

Tekla.Structures.ModelInternal.BasePoint.round(System.Double)
Cast double to integer by Rounding away from zero.
value: rounding double.
Returns: Rounded integer.

Tekla.Structures.ModelInternal.BasePoint.DegreesMinutesSeconds(System.Double,System.Int32)
Converts angle value to compound plane angle: degree, minue and second.
angle:  Lat or lon angle.
range:  Lat or lon range. ONE OF [90 || 180]
Returns: Tuple(bool, int, int, int), where bool is validity, item0 = degree, item1 = minute, item2 = second

Tekla.Structures.ModelInternal.BasePoint.#ctor(System.Int32,System.Guid,System.String,System.String,System.String,System.Double,System.Double,System.Double,System.Double,System.Double,System.Double,System.Double,System.Double,System.Double)
Initializes a new instance of the Tekla.Structures.ModelInternal.BasePoint class.
id: The id.
guid: The guid.
name: The name.
description: The description.
coordinateSystem: The coordinate system.
northSouth: The north-south.
eastWest: The east-west.
elevation: The elevation.
latitude: The latitude.
longitude: The longitude.
locationInModelX: The location in model x.
locationInModelY: The location in model y.
locationInModelZ: The location in model z.
angleToNorth: The angle to north.

Tekla.Structures.ModelInternal.BasePoint.Id
Gets or sets the id.

Tekla.Structures.ModelInternal.BasePoint.Guid
Gets or sets the guid.

Tekla.Structures.ModelInternal.BasePoint.Name
Gets or sets the name.

Tekla.Structures.ModelInternal.BasePoint.Description
Gets or sets the description.

Tekla.Structures.ModelInternal.BasePoint.CoordinateSystem
Gets or sets the coordinate system.

Tekla.Structures.ModelInternal.BasePoint.NorthSouth
Gets or sets the north-south.

Tekla.Structures.ModelInternal.BasePoint.EastWest
Gets or sets the east-west.

Tekla.Structures.ModelInternal.BasePoint.Elevation
Gets or sets the elevation.

Tekla.Structures.ModelInternal.BasePoint.Latitude
Gets or sets the latitude.

Tekla.Structures.ModelInternal.BasePoint.Longitude
Gets or sets the longitude.

Tekla.Structures.ModelInternal.BasePoint.LocationInModelX
Gets or sets the location in model x.

Tekla.Structures.ModelInternal.BasePoint.LocationInModelY
Gets or sets the location in model y.

Tekla.Structures.ModelInternal.BasePoint.LocationInModelZ
Gets or sets the location in model z.

Tekla.Structures.ModelInternal.BasePoint.AngleToNorth
Gets or sets the angle to north in radians.

Tekla.Structures.ModelInternal.BasePoint.GetCoordinateSystem(Tekla.Structures.ModelInternal.BasePoint.CoordinateSystemType)
Gets the coordinate system of the base point.
CoordsysType: Optional: Type of the coordinate system.
Returns: The coordinate system of the base point.

Tekla.Structures.ModelInternal.BasePoint.GetCompoundPlaneAngleLatitude
Gets the Latitude as a compound plane angle.
Returns: compound plane angle integers. The first param is true, if the value successfully calculated.

Tekla.Structures.ModelInternal.BasePoint.GetCompoundPlaneAngleLongitude
Gets the Longitude as a compound plane angle.
Returns: compound plane angle integers. The first param is true, if the value successfully calculated.